In [1]:
import pandas as pd
import numpy as np
# maybe import datetime
import plotly.express as px

In [2]:
df_temp_pre2005 = pd.read_csv('data/at/tempjouzelaicc2005-800kyr.csv')
df_temp_pre2005.head(2)

   bag  ztop  EDC3béta   AICC2012  deutfinal   temp  acc-EDC3beta
0    1  0.00 -50.00000 -55.000000        NaN  218.3      3.105321
1    2  0.55 -43.55977 -50.513333        NaN  218.3      3.104805

In [3]:
df_temp_post2005 = pd.read_csv('data/at/tempglobalanomnoaa1850-2022.csv', 
                               skiprows=4)
df_temp_post2005.head(2)

   Year  Anomaly
0  1850    -0.37
1  1851    -0.12

In [4]:
df_temp_anom = pd.read_csv('data/at/tempnoaajoudelt2000-801662.txt', skiprows=91, delimiter='\t')
df_temp_anom.head(2)

   Bag         ztop          Age         Deuterium    anom c
0                    1            0        -50.00000
1                    2         0.55        -43.54769

In [5]:
columns = df_temp_anom.columns.str.split()[0][:-1]
columns

['Bag', 'ztop', 'Age', 'Deuterium', 'anom']

In [6]:
anom_split = df_temp_anom[' Bag         ztop          Age         Deuterium    anom c'].str.split()
anom_split.tail(3)

5797    [5798, 3188.35, 799501, -441.1, -8.88]
5798    [5799, 3188.9, 800589, -441.42, -8.92]
5799    [5800, 3189.45, 801662, -440.9, -8.82]
Name:  Bag         ztop          Age         Deuterium    anom c, dtype: object

In [7]:
for index, col in enumerate(columns):
    
    if col == 'anom':
        col = 'anom c'
    
    df_temp_anom[col] = anom_split.str[index]

In [8]:
df_temp_anom = df_temp_anom.iloc[:, 1:].copy()

In [9]:
df_temp_anom

       Bag     ztop        Age Deuterium anom c
0        1        0  -50.00000       NaN    NaN
1        2     0.55  -43.54769       NaN    NaN
2        3      1.1  -37.41829       NaN    NaN
3        4     1.65  -31.61153       NaN    NaN
4        5      2.2  -24.51395       NaN    NaN
...    ...      ...        ...       ...    ...
5795  5796  3187.25     797408    -440.2  -8.73
5796  5797   3187.8     798443      -439  -8.54
5797  5798  3188.35     799501    -441.1  -8.88
5798  5799   3188.9     800589   -441.42  -8.92
5799  5800  3189.45     801662    -440.9  -8.82

[5800 rows x 5 columns]

In [10]:
# cheloulerge = columns year and ch4 (ppbv) until 1937

# chrubino = columns year and ch4 (ppbv)1938-1983

# chnoaa = columns year and ch4 (ppbv) 1984-2022

df_ch4_pre1937 = pd.read_csv('data/ch4/cheloulergue800kyr-1937.txt', skiprows = 153)
df_ch4_pre1937.head(10)

  Depth      Gas Age   CH4 mean   1s    Lab.
0  99.34           13     907      10      b
1  102.45         126     784      10      g
2  102.58         130     762      10      b
3  103.34         151     710      10      g
4  104.33         184     727      10      g
5  104.69         202     696      10      g
6  104.78         207     683      10      b
7  106.61         258     679      10      g
8  107.69         297     676      10      g
9  108.79         345     651      10      g

In [12]:
df_irerain_1831_1852= pd.read_csv('data/ire/irrainIOI_1711-2016.csv')
df_irerain_1831_1852.head(3)

   Year  Month  Median montly series
0  1711      1                  16.4
1  1711      2                  73.1
2  1711      3                 121.2

In [14]:
df_irerain_1831_1852['year float'] = df_irerain_1831_1852['Year'] + df_irerain_1831_1852['Month'] / 12

In [16]:
df_irerain_1831_1852.head(3)

   Year  Month  Median montly series   year float
0  1711      1                  16.4  1711.083333
1  1711      2                  73.1  1711.166667
2  1711      3                 121.2  1711.250000

In [22]:
df_irerain_1853_1854 = pd.read_csv('data/ire/irtempbotgdn1834-1958.csv', #encoding='utf-8',
                                    encoding_errors='ignore')
df_irerain_1853_1854.head(3)

   Year  Month  Day  Max (F)  Min (F)  Max (C)  Min (C)
0  1834      1    1     41.0     39.0      5.0      3.9
1  1834      1    2     38.0     40.0      3.3      4.4
2  1834      1    3     52.0     50.0     11.1     10.0

In [24]:
df_irerain_1853_1854['dmy'] = (df_irerain_1853_1854['Day'].astype(str) + '-' + 
                               df_irerain_1853_1854['Month'].astype(str) + '-' + 
                               df_irerain_1853_1854['Year'].astype(str))

In [25]:
df_irerain_1853_1854['dmy'] = pd.to_datetime(df_irerain_1853_1854['dmy'], format='mixed')

df_irerain_1853_1854['dmy float'] =  np.where(df_irerain_1853_1854['dmy'].dt.is_leap_year == True,
                                              
                                        # normal year, 365 days
                                        df_irerain_1853_1854['dmy'].dt.year + df_irerain_1853_1854['dmy'].dt.day_of_year / 365, 

                                        # 366 for a leap year
                                        df_irerain_1853_1854['dmy'].dt.year + df_irerain_1853_1854['dmy'].dt.day_of_year / 366 
                                        )

In [26]:
df_irerain_1853_1854.head(3)

,Year,Month,Day,Max (F),Min (F),Max (C),Min (C),dmy,dmy float
0,1834,1,1,41.0,39.0,5.0,3.9,1834-01-01,1834.002732
1,1834,1,2,38.0,40.0,3.3,4.4,1834-02-01,1834.087432
2,1834,1,3,52.0,50.0,11.1,10.0,1834-03-01,1834.163934